---
kind: property
id: P:Autodesk.Revit.DB.FabricationDimensionDefinition.Name
source: html/2e6e381b-e569-a6d4-a30f-0621a4069dc8.htm
---
# Autodesk.Revit.DB.FabricationDimensionDefinition.Name Property

Fabrication dimension name.

## Syntax (C#)
```csharp
public string Name { get; }
```